# Caiolisp

Let's have fun pretending I have the slightest idea of what I'm doing here

## Samples of how it currently works

```
(+ 1 1)
> 1
(+ 3 (- 2 1))
> 2
(= 3 2)
> false
(if (= 2 2) 1 3)
> 1
(def conquest 42)
> 42
(defn inc (x) (+ x 1))
> <Fn>
(inc conquest)
> 43
```
